# Задача-4:
# Даны четыре точки А1(х1, у1), А2(x2 ,у2), А3(x3 , у3), А4(х4, у4).
# Определить, будут ли они вершинами параллелограмма.

__author__ = 'Сайно Михаил Викторович'
print("Автор ",__author__)
#import math
a1=(0, 4)
a2=(1, 4)
a3=(0 , 0)
a4=(1, 0)

u1=abs(a2[0]-a1[0])==abs(a3[0]-a4[0])
u2=abs(a2[1]-a1[1])==abs(a3[1]-a4[1])

u3=abs(a2[0]-a3[0])==abs(a1[0]-a4[0])
u4=abs(a2[1]-a3[1])==abs(a1[1]-a4[1])

if (u1 and u2) or (u3 and u4):
    print('Да - паралеллограмм')
else:
    print('Нет - не паралеллограмм')