# Задание 2 normal

__author__ = 'Сайно Михаил Викторович'
print("Автор ",__author__)

x=input('Введите 1-е число ')
y=input('Введите 2-е число ')
x,y=y,x
print("x=",x," y=",y)
